amarildolacerda/homeware/clients/esp8266_lampada/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ArduinoJson.h>
#include <EEPROM.h>
#include <LittleFS.h>
#include <Updater.h>
#include <espnow.h>
#ifdef HABILITA_ALEXA
#include <Espalexa.h>
#endif
#include "config.h"
#include "pages.h"
#include "espnow_protocol.h"
#include "common_console.h"
#include "common_ota.h"
#include "common_util.h"
#include "common_wifi.h"
#include "common_espnow.h"
#include "common_web.h"
#include "common_repeater.h"
#include "timer.h"

static const char *TAG = "esp8266-lampada";

static unsigned long s_last_state_update = 0;
static unsigned long s_last_telemetry_update = 0;
static unsigned long s_last_reconnect_attempt = 0;
static unsigned long s_last_espnow_send = 0;
static unsigned long s_last_espnow_pair = 0;
static unsigned long s_last_heartbeat = 0;
static unsigned long s_last_alexa_activity = 0;
static unsigned long s_send_deadline = 0;
static int s_send_retries_left = 0;
static unsigned long s_pair_wait_until = 0;

static bool s_gateway_connected = false;
static bool s_paired = false;
static uint8_t s_gateway_mac[6];

static bool mac_is_nonzero(const uint8_t *mac) {
    return mac[0] || mac[1] || mac[2] || mac[3] || mac[4] || mac[5];
}
static uint16_t s_sequence = 0;
static uint16_t s_assigned_slot = 0;
static int s_pair_attempts = 0;
static bool s_ack_received = false;
static bool s_send_pending = false;
static bool s_espnow_ready = false;

static bool s_relay_state = false;
static int s_relay_pin = RELAY_PIN;
static int s_button_pin = BUTTON_PIN;
static int s_battery = 100;
static bool s_button_last = HIGH;
static unsigned long s_button_last_ms = 0;
static unsigned long s_start_time = 0;
static unsigned long s_last_send_ms = 0;

static uint32_t s_espnow_tx_count = 0;
static uint32_t s_espnow_rx_count = 0;
static uint32_t s_on_count = 0;

static int s_timezone_offset = -3;
static unsigned long s_synced_epoch = 0;
static unsigned long s_sync_millis = 0;
static bool s_tz_changed = false;

static char s_device_id[32];
static char s_device_name[32] = DEVICE_NAME;

static unsigned long s_wifi_config_start_time = 0;
static bool s_config_portal_active = false;
static bool s_ota_in_progress = false;
static uint32_t s_ota_bytes = 0;
static bool s_led_enabled = true;
static int s_startup_mode = 0; // 0=OFF, 1=ON, 2=LAST
static uint8_t s_my_mac[6];
static unsigned long s_wifi_connect_start = 0;
static bool s_wifi_connected = false;

static ESP8266WebServer s_server(DASHBOARD_PORT);
#ifdef HABILITA_ALEXA
static Espalexa s_alexa;
static EspalexaDevice *s_alexa_dev = nullptr;
static bool s_alexa_initialized = false;
#endif

static uint8_t s_broadcast_mac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

// D1-MINI é invtido
#define LED_ON LOW   // GPIO2 acende com LOW
#define LED_OFF HIGH // GPIO2 apaga com HIGH

#define EEPROM_GATEWAY_MAC_ADDR 0
#define EEPROM_GATEWAY_MAC_SIZE 6
#define EEPROM_NAME_ADDR 10
#define EEPROM_NAME_MAX 48
#define EEPROM_RELAY_STATE_ADDR (EEPROM_NAME_ADDR + EEPROM_NAME_MAX + 1)
#define EEPROM_RELAY_PIN_ADDR (EEPROM_RELAY_STATE_ADDR + 1)
#define EEPROM_BUTTON_PIN_ADDR (EEPROM_RELAY_PIN_ADDR + 1)
#define EEPROM_LED_ENABLED_ADDR (EEPROM_BUTTON_PIN_ADDR + 1)
#define EEPROM_STARTUP_MODE_ADDR (EEPROM_LED_ENABLED_ADDR + 1)
#define EEPROM_REPEATER_EN_ADDR (EEPROM_STARTUP_MODE_ADDR + 1)
#define EEPROM_SSID_ADDR 64
#define EEPROM_SSID_MAX 32
#define EEPROM_PASS_ADDR (EEPROM_SSID_ADDR + EEPROM_SSID_MAX)
#define EEPROM_PASS_MAX 64
#define EEPROM_MAGIC 0xAA

#define SYNC_LITTLEFS_FILE "/sync.json"
#define KNOWN_DEVICES_FILE "/known_devices.json"
#define MAX_KNOWN_DEVICES 16

typedef struct {
    bool enabled;
    char target_device_id[32];
} sync_config_t;

static sync_config_t s_sync_cfg = {false, ""};

static void sync_load(void)
{
    if (!LittleFS.exists(SYNC_LITTLEFS_FILE)) return;
    File f = LittleFS.open(SYNC_LITTLEFS_FILE, "r");
    if (!f) return;
    StaticJsonDocument<128> doc;
    DeserializationError err = deserializeJson(doc, f);
    f.close();
    if (err) return;
    s_sync_cfg.enabled = doc["enabled"] | false;
    const char *tid = doc["target_device_id"] | "";
    strncpy(s_sync_cfg.target_device_id, tid, sizeof(s_sync_cfg.target_device_id) - 1);
    s_sync_cfg.target_device_id[sizeof(s_sync_cfg.target_device_id) - 1] = '\0';
}

static void devices_load(JsonDocument &doc)
{
    if (!LittleFS.exists(KNOWN_DEVICES_FILE))
    {
        JsonArray arr = doc.to<JsonArray>();
        arr.add(s_device_id);
        return;
    }
    File f = LittleFS.open(KNOWN_DEVICES_FILE, "r");
    if (!f) { doc.to<JsonArray>(); return; }
    DeserializationError err = deserializeJson(doc, f);
    f.close();
    if (err) doc.to<JsonArray>();
}

static void devices_add(const char *device_id)
{
    if (!device_id || strlen(device_id) == 0) return;
    JsonDocument doc;
    devices_load(doc);
    JsonArray arr = doc.as<JsonArray>();
    for (JsonVariant v : arr)
        if (strcmp(v, device_id) == 0) return;
    if (arr.size() >= MAX_KNOWN_DEVICES)
        arr.remove(0);
    arr.add(device_id);
    File f = LittleFS.open(KNOWN_DEVICES_FILE, "w");
    if (!f) return;
    serializeJson(doc, f);
    f.close();
}

static void sync_save(void)
{
    StaticJsonDocument<128> doc;
    doc["enabled"] = s_sync_cfg.enabled;
    doc["target_device_id"] = s_sync_cfg.target_device_id;
    File f = LittleFS.open(SYNC_LITTLEFS_FILE, "w");
    if (!f) return;
    serializeJson(doc, f);
    f.close();
}

static void repeater_send_adapter(const uint8_t *mac, const uint8_t *data, int len, const char *tag)
{
    espnow_send_wrapper(mac, data, (size_t)len, tag);
}

static void save_relay_state(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_RELAY_STATE_ADDR, s_relay_state ? 1 : 0);
    EEPROM.commit();
    EEPROM.end();
}

static void load_relay_state(void)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t val = EEPROM.read(EEPROM_RELAY_STATE_ADDR);
    EEPROM.end();
    s_relay_state = (val == 1);
}

static void save_relay_pin(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_RELAY_PIN_ADDR, (uint8_t)s_relay_pin);
    EEPROM.commit();
    EEPROM.end();
}

